## 19. 시계열 데이터3

### 주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과 2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오. 단 Events컬럼이 '1'인 경우 80%의 Salse값만 반영함 (최종값은 소수점 반올림 후 정수 출력)
- 데이터셋 : basic2.csv

In [48]:
import pandas as pd

df = pd.read_csv('../data/basic2.csv')
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [49]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [50]:
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month

In [51]:
### Events컬럼이 '1'인 경우 80%의 Salse값만 반영
def events(df):
    df['Sales'] = df['Sales'] * 0.8 if df['Events'] == 1 else df['Sales']
    return df

df = df.apply(lambda x: events(x), axis=1)
df.head()

        Date       Sales      PV      UV  Events  Year  Month
0 2022-01-01  18169220.0  397349  4421.0       1  2022      1
1 2022-01-02     36779.0    3969  2289.0       0  2022      1
2 2022-01-03  11155100.0  373890     NaN       1  2022      1
3 2022-01-04   8088593.0  142054  2157.0       0  2022      1
4 2022-01-05   2395374.0  190684     NaN       0  2022      1

In [52]:
year1 = df[df['Year']==2022]
year1['Events'].value_counts()

0    271
1     94
Name: Events, dtype: int64

In [60]:
# 2022년 월별 sales합계
sales_2022 = year1.groupby(year1['Month'])[['Sales']].sum()

sales_2022

             Sales
Month
1      114475247.2
2      153453688.6
3      172483809.4
4      111466880.8
5      121801396.0
6      165288258.4
7      197145878.0
8      108173602.2
9      157752502.6
10     183253174.0
11      89359502.2
12     191208107.8

In [56]:
sales_max_2022 = sales_2022['Sales'].max()
print(sales_max_2022)

197145878.0

In [57]:
year2 = df[df['Year']==2023]
year2['Events'].value_counts()

0    267
1     98
Name: Events, dtype: int64

In [61]:
# 2023년 월별 sales합계
sales_2023 = year2.groupby(year2['Month'])[['Sales']].sum()

sales_2023

             Sales
Month
1      183416542.6
2      163354661.6
3      198438634.6
4      112160979.0
5      143287169.2
6      133574075.4
7      131657675.4
8      131982344.2
9      219594547.6
10     155630473.2
11     239619313.8
12     139131255.4

In [62]:
sales_max_2023 = sales_2023['Sales'].max()
print(sales_max_2023)

239619313.8

In [63]:
print(abs(sales_max_2023-sales_max_2022))

42473435.80000001

In [64]:
print(round(abs(sales_max_2023-sales_max_2022)))

42473436

<br><br>

## 20. 데이터 병합
### 고객과 잘 맞는 타입 추천 :)
### basic1 데이터와 basic3 데이터를 basic1의 'f4'값을 기준으로 병합하고, 병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오
- basic1.csv: 고객 데이터
- basic3.csv: 잘 어울리는 관계 데이터 (추천1:r1, 추천2:r2)

In [103]:
import pandas as pd

df = pd.read_csv('../data/basic1.csv')
df2 = pd.read_csv('../data/basic3.csv')

df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [104]:
df2.head()

     f4    r1    r2
0  INFP  ENFJ  ENTJ
1  ENFP  INFJ   NaN
2  INFJ  ENFP  ENTP
3  ENFJ  INFP  ISFP
4  INTJ  ENFP  ENTP

In [105]:
df.shape, df2.shape

((100, 8), (16, 3))

In [107]:
df_merge = pd.merge(df, df2, how="left", on="f4")             # how: 기준 데이터프레임, on: 기준 컬럼

In [108]:
df_merge

       id    age city    f1  f2   f3    f4         f5    r1    r2
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986  ESFP   NaN
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078  ENFJ  ENTJ
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869  ESFP  ESTP
..    ...    ...  ...   ...  ..  ...   ...        ...   ...   ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078  INFP   NaN
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373  ENFJ  ENTJ
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899  ENFJ  ENTJ
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034  ISFP  ISTP
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999  ISFJ  ISTJ

[100 rows x 10 columns]

In [109]:
df_merge['r2'].isnull().sum()

17

In [110]:
df_merge = df_merge[~df_merge['r2'].isnull()]

In [111]:
df_merge['r2'].isnull().sum()

0

In [112]:
# 앞에서부터 20개 데이터의 f2컬럼의 합
print(df_merge.iloc[:20, 4].sum())

15

<br><br>
## 21. 구간 분할
### basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오 (이상치는 음수(0포함), 소수점 값)
- data: basic1.csv

In [128]:
import pandas as pd
df = pd.read_csv('../data/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [129]:
import numpy as np

# 이상치 제거
df = df[(df['age'] > 0) & (df['age'] - np.floor(df['age']) == 0)]
df['age'].value_counts()

75.0    4
56.0    3
97.0    3
87.0    3
77.0    3
       ..
44.0    1
95.0    1
93.0    1
18.0    1
1.0     1
Name: age, Length: 61, dtype: int64

In [130]:
df.shape

(90, 8)

In [132]:
## qcut()
df['groups'] = pd.qcut(df['age'], q=3, labels=['group1','group2','group3'])
df['groups'].value_counts()

group1    30
group2    30
group3    30
Name: groups, dtype: int64

In [138]:
g1_median = df[df['groups']=='group1']['age'].median()
g2_median = df[df['groups']=='group2']['age'].median()
g3_median = df[df['groups']=='group3']['age'].median()

print(g1_median+g2_median+g3_median)

165.0